logs/kube-n10-c10/ab.log
[jim@localhost hello]$ ab -n10 -c10 -p /tmp/json -T "application/json" -H "Authorization: Basic Nzg5YzQ2YjEtNzFmNi00ZWQ1LThjNTQtODE2YWE0ZjhjNTAyOmFiY3pPM3haQ0xyTU42djJCS0sxZFhZRnBYbFBrY2NPRnFtMTJDZEFzTWdSVTRWck5aOWx5R1ZDR3VNREdJd1A=" "http://192.168.99.100:32355/api/v1/namespaces/_/actions/hi?blocking=true&result=true"
This is ApacheBench, Version 2.3 <$Revision: 1757674 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.99.100 (be patient).....done


Server Software:        spray-can/1.3.4
Server Hostname:        192.168.99.100
Server Port:            32355

Document Path:          /api/v1/namespaces/_/actions/hi?blocking=true&result=true
Document Length:        31 bytes

Concurrency Level:      10
Time taken for tests:   4.646 seconds
Complete requests:      10
Failed requests:        0
Total transferred:      2700 bytes
Total body sent:        3720
HTML transferred:       310 bytes
Requests per second:    2.15 [#/sec] (mean)
Time per request:       4645.930 [ms] (mean)
Time per request:       464.593 [ms] (mean, across all concurrent requests)
Transfer rate:          0.57 [Kbytes/sec] received
                        0.78 kb/s sent
                        1.35 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   685 2047 1373.9   1421    4645
Waiting:      684 2046 1373.7   1420    4645
Total:        685 2048 1373.9   1421    4646

Percentage of the requests served within a certain time (ms)
  50%   1421
  66%   2296
  75%   2777
  80%   4064
  90%   4646
  95%   4646
  98%   4646
  99%   4646
 100%   4646 (longest request)